test1.yml
config:
  target: "http://httpbin.org/"
  phases:
    - duration: 60
      arrivalRate: 10
      name: Artillery First Test
scenarios:
  - name: Getting a resource
    flow:
      - get:
          url: "/get"
      - post:
          url: "/post"
          json:
            username: "Test User"
            password: "Temp Password"